/*
Дополните  Calculator базовыми арифметическими операциями:
1) Суммирование, разность, умножение
2) Деление всех видов (целое, с остатком, обычное деление)
3) Не забудьте учесть особенности типов и поиграться с перегрузками

В main нужно придумать запустить свой простенький тест (например, проверить каждую операцию по очереди)


Не забывайте про кодстайл, за решение задачки дают семинарские баллы)
*/


// Базовые методы для арифм. операций
int Add(const int a, const int b);

int Multiply(const int a, const int b);

    ...

int main() {
  int a = 5;
  int b = 7;
  
  assert((Add(a, b) != 12) && "Мы не смогли сложить!");
}
